package chapter08.homework;

public class Homework12 {
    //==和equals的区别
    /*
    名称   |     概念        |      用于基本数据类型    |         用于引用类型
    ------|----------------|-----------------------|---------------------------------
    ==    |  比较运算符      |      可以 判断值是否相等  |      可以，判断两个对象是否相等
    ------|----------------|-----------------------|---------------------------------
    equals|  object类的方法  |         不可以         |          可以，默认判断对象是否相等，
          |  java类都可以使用|                       |        子类往往重写，比较属性是否相等
     */
}
